zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE316/startup_MCXE316.c
#if !defined(BYPASS_ECC_SRAM_INIT)
    __asm volatile ("LDR     R0, =0x20400000     \n"
                    "LDR     R2, =0x4028C000     \n"
                    "LDR     R2, [R2]            \n"
                    "LSLS    R2, R2, #31         \n"
                    "BPL.N   ram_init_done       \n"
                    "LDR     R1, =0x20407FFF     \n"
                    "LDR     R2, =0              \n"
                    "LDR     R3, =0              \n"
                    "LDR     R4, =0              \n"
                    "LDR     R5, =0              \n"
                    "loop03:                     \n"
                    "STMIA   R0!, {R2 - R5}      \n"
                    "CMP     R0, R1              \n"
                    "BCC.N   loop03              \n"
                    "ram_init_done:              \n"
                    );
#endif

    // Call Reset_Handler_C
    __asm volatile ("LDR R0, =Reset_Handler_C \n"
                    "BLX R0                   \n"
                    );
}

//*****************************************************************************
// Default core exception handlers. Override the ones here by defining your own
// handler routines in your application code.
//*****************************************************************************
WEAK_AV void NMI_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void HardFault_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void MemManage_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void BusFault_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void UsageFault_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void SVC_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void DebugMon_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void PendSV_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void SysTick_Handler(void)
{
    while(1)
    {
    }
}

//*****************************************************************************
// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.
//*****************************************************************************
WEAK_AV void DefaultISR(void)
{
    while(1)
    {
    }
}

WEAK_AV void DefaultISR1(uint32_t instance)
{
    while(1)
    {
    }
}

WEAK_AV void DefaultISR3(uint32_t instance, uint32_t start, uint32_t end)
{
    while(1)
    {
    }
}

//*****************************************************************************
// Default application exception handlers. Override the ones here by defining
// your own handler routines in your application code. These routines call
// driver exception handlers or DefaultISR() if no driver exception
// handler is included.
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void)
{
    Reserved16_DriverIRQHandler();
}

WEAK void Reserved17_IRQHandler(void)
{
    Reserved17_DriverIRQHandler();
}

WEAK void Reserved18_IRQHandler(void)
{
    Reserved18_DriverIRQHandler();
}

WEAK void Reserved19_IRQHandler(void)
{
    Reserved19_DriverIRQHandler();
}

WEAK void DMATCD0_IRQHandler(void)
{
    DMATCD0_DriverIRQHandler();
}

WEAK void DMATCD1_IRQHandler(void)
{
    DMATCD1_DriverIRQHandler();
}

WEAK void DMATCD2_IRQHandler(void)
{
    DMATCD2_DriverIRQHandler();
}

WEAK void DMATCD3_IRQHandler(void)
{
    DMATCD3_DriverIRQHandler();
}

WEAK void DMATCD4_IRQHandler(void)
{
    DMATCD4_DriverIRQHandler();
}

WEAK void DMATCD5_IRQHandler(void)
{
    DMATCD5_DriverIRQHandler();
}

WEAK void DMATCD6_IRQHandler(void)
{
    DMATCD6_DriverIRQHandler();
}

WEAK void DMATCD7_IRQHandler(void)
{
    DMATCD7_DriverIRQHandler();
}

WEAK void DMATCD8_IRQHandler(void)
{
    DMATCD8_DriverIRQHandler();
}

WEAK void DMATCD9_IRQHandler(void)
{
    DMATCD9_DriverIRQHandler();
}

WEAK void DMATCD10_IRQHandler(void)
{
    DMATCD10_DriverIRQHandler();
}

WEAK void DMATCD11_IRQHandler(void)
{
    DMATCD11_DriverIRQHandler();
}

WEAK void Reserved32_IRQHandler(void)
{
    Reserved32_DriverIRQHandler();
}

WEAK void Reserved33_IRQHandler(void)
{
    Reserved33_DriverIRQHandler();
}

WEAK void Reserved34_IRQHandler(void)
{
    Reserved34_DriverIRQHandler();
}

WEAK void Reserved35_IRQHandler(void)
{
    Reserved35_DriverIRQHandler();
}

WEAK void Reserved36_IRQHandler(void)
{
    Reserved36_DriverIRQHandler();
}

WEAK void Reserved37_IRQHandler(void)
{
    Reserved37_DriverIRQHandler();
}

WEAK void Reserved38_IRQHandler(void)
{
    Reserved38_DriverIRQHandler();
}

WEAK void Reserved39_IRQHandler(void)
{
    Reserved39_DriverIRQHandler();
}

WEAK void Reserved40_IRQHandler(void)
{
    Reserved40_DriverIRQHandler();
}

WEAK void Reserved41_IRQHandler(void)
{
    Reserved41_DriverIRQHandler();
}

WEAK void Reserved42_IRQHandler(void)
{
    Reserved42_DriverIRQHandler();
}

WEAK void Reserved43_IRQHandler(void)
{
    Reserved43_DriverIRQHandler();
}

WEAK void Reserved44_IRQHandler(void)
{
    Reserved44_DriverIRQHandler();
}

WEAK void Reserved45_IRQHandler(void)
{
    Reserved45_DriverIRQHandler();
}

WEAK void Reserved46_IRQHandler(void)
{
    Reserved46_DriverIRQHandler();
}

WEAK void Reserved47_IRQHandler(void)
{
    Reserved47_DriverIRQHandler();
}

WEAK void Reserved48_IRQHandler(void)
{
    Reserved48_DriverIRQHandler();
}

WEAK void Reserved49_IRQHandler(void)
{
    Reserved49_DriverIRQHandler();
}

WEAK void Reserved50_IRQHandler(void)
{
    Reserved50_DriverIRQHandler();
}

WEAK void Reserved51_IRQHandler(void)
{
    Reserved51_DriverIRQHandler();
}

WEAK void ERM_0_IRQHandler(void)
{
    ERM_0_DriverIRQHandler();
}

WEAK void ERM_1_IRQHandler(void)
{
    ERM_1_DriverIRQHandler();
}

WEAK void MCM_IRQHandler(void)
{
    MCM_DriverIRQHandler();
}

WEAK void STM0_IRQHandler(void)
{
    STM_DriverIRQHandler(0U);
}

WEAK void Reserved56_IRQHandler(void)
{
    Reserved56_DriverIRQHandler();
}

WEAK void Reserved57_IRQHandler(void)
{
    Reserved57_DriverIRQHandler();
}

WEAK void SWT0_IRQHandler(void)
{
    SWT0_DriverIRQHandler();
}

WEAK void Reserved59_IRQHandler(void)
{
    Reserved59_DriverIRQHandler();
}

WEAK void Reserved60_IRQHandler(void)
{
    Reserved60_DriverIRQHandler();
}

WEAK void CTI_INT0_IRQHandler(void)
{
    CTI_INT0_DriverIRQHandler();
}

